## Terraform Plan Output - nprd - hub
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus-AzureFirewallSubnet"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/routeTables/route-eastus"
      + subnet_id      = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/AzureFirewallSubnet"
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus-GatewaySubnet"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/routeTables/route-eastus"
      + subnet_id      = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/GatewaySubnet"
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus-dbdemo-nprd-hub-eastus-snet-ServiceNowVM"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/routeTables/route-eastus"
      + subnet_id      = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/dbdemo-nprd-hub-eastus-snet-ServiceNowVM"
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus-dbdemo-nprd-hub-eastus-snet-ehsplunk"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/routeTables/route-eastus"
      + subnet_id      = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/dbdemo-nprd-hub-eastus-snet-ehsplunk"
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus-dbdemo-nprd-hub-eastus-snet-integration"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/routeTables/route-eastus"
      + subnet_id      = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/dbdemo-nprd-hub-eastus-snet-integration"
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus-dbdemo-nprd-hub-eastus-snet-integration2"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/routeTables/route-eastus"
      + subnet_id      = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/dbdemo-nprd-hub-eastus-snet-integration2"
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus-dbdemo-nprd-hub-eastus-snet-integration3"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/routeTables/route-eastus"
      + subnet_id      = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/dbdemo-nprd-hub-eastus-snet-integration3"
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus-dbdemo-nprd-hub-eastus-snet-pvtendpoint"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/routeTables/route-eastus"
      + subnet_id      = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/dbdemo-nprd-hub-eastus-snet-pvtendpoint"
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus-dbdemo-nprd-hub-eastus-snet-vmss"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/routeTables/route-eastus"
      + subnet_id      = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/dbdemo-nprd-hub-eastus-snet-vmss"
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus2-AzureFirewallSubnet"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/routeTables/route-eastus2"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus2-GatewaySubnet"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/routeTables/route-eastus2"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus2-dbdemo-nprd-hub-eastus-snet-ServiceNowVM"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/routeTables/route-eastus2"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus2-dbdemo-nprd-hub-eastus-snet-ehsplunk"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/routeTables/route-eastus2"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus2-dbdemo-nprd-hub-eastus-snet-integration"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/routeTables/route-eastus2"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus2-dbdemo-nprd-hub-eastus-snet-integration2"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/routeTables/route-eastus2"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus2-dbdemo-nprd-hub-eastus-snet-integration3"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/routeTables/route-eastus2"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus2-dbdemo-nprd-hub-eastus-snet-pvtendpoint"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/routeTables/route-eastus2"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_subnet_route_table_association.hub_routing_creat["eastus2-dbdemo-nprd-hub-eastus-snet-vmss"] will be created
  + resource "azurerm_subnet_route_table_association" "hub_routing_creat" {
      + id             = (known after apply)
      + route_table_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/routeTables/route-eastus2"
      + subnet_id      = (known after apply)
    }

  # module.hub.module.hubnetworks.azurerm_virtual_network_peering.hub_peering["dbdemo-nprd-hub-eastus-fw-dbdemo-nprd-hub-eastus2-fw"] will be created
  + resource "azurerm_virtual_network_peering" "hub_peering" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = true
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "dbdemo-nprd-hub-eastus-fw-dbdemo-nprd-hub-eastus2-fw"
      + remote_virtual_network_id    = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus2-fw"
      + resource_group_name          = "dbdemo-nprd-hub-eastus-rg"
      + use_remote_gateways          = false
      + virtual_network_name         = "dbdemo-nprd-hub-eastus-fw"
    }

  # module.hub.module.hubnetworks.azurerm_virtual_network_peering.hub_peering["dbdemo-nprd-hub-eastus2-fw-dbdemo-nprd-hub-eastus-fw"] will be created
  + resource "azurerm_virtual_network_peering" "hub_peering" {
      + allow_forwarded_traffic      = true
      + allow_gateway_transit        = true
      + allow_virtual_network_access = true
      + id                           = (known after apply)
      + name                         = "dbdemo-nprd-hub-eastus2-fw-dbdemo-nprd-hub-eastus-fw"
      + remote_virtual_network_id    = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw"
      + resource_group_name          = "dbdemo-nprd-hub-eastus2-rg"
      + use_remote_gateways          = false
      + virtual_network_name         = "dbdemo-nprd-hub-eastus2-fw"
    }

  # module.hub.module.private_dns_zones["privatelink.blob.core.windows.net"].azurerm_private_dns_zone_virtual_network_link.vnetlink[0] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnetlink" {
      + id                    = (known after apply)
      + name                  = "privatelink.blob.core.windows.net0"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dbdemo-nprd-private-dns-eastus-rg"
      + tags                  = {
          + "environment" = "nprd"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "hub"
        }
      + virtual_network_id    = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw"
    }

  # module.hub.module.private_dns_zones["privatelink.blob.core.windows.net"].azurerm_private_dns_zone_virtual_network_link.vnetlink[1] will be created
  + resource "azurerm_private_dns_zone_virtual_network_link" "vnetlink" {
      + id                    = (known after apply)
      + name                  = "privatelink.blob.core.windows.net1"
      + private_dns_zone_name = "privatelink.blob.core.windows.net"
      + registration_enabled  = false
      + resource_group_name   = "dbdemo-nprd-private-dns-eastus-rg"
      + tags                  = {
          + "environment" = "nprd"
          + "owner"       = "av"
          + "source"      = "terraform"
          + "stack"       = "hub"
        }
      + virtual_network_id    = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus2-fw"
    }

  # module.hub.module.virtual_network_diagnostics["eastus"].azurerm_monitor_diagnostic_setting.diag will be created
  + resource "azurerm_monitor_diagnostic_setting" "diag" {
      + eventhub_authorization_rule_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-azmon-eastus-rg/providers/Microsoft.EventHub/namespaces/dbdemo-nprd-azmon-eastus-ehn/authorizationRules/RootManageSharedAccessKey"
      + eventhub_name                  = "dbdemo-nprd-azmon-eastus-ehn"
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-azmon-eastus-rg/providers/Microsoft.OperationalInsights/workspaces/dbdemo-nprd-azmon-eastus-log"
      + name                           = "dbdemo-nprd-hub-eastus-fw-diag"
      + storage_account_id             = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-azmon-eastus-rg/providers/Microsoft.Storage/storageAccounts/dbdemonprdazmoneastusstv"
      + target_resource_id             = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw"

      + enabled_log {
          + category = "VMProtectionAlerts"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.hub.module.virtual_network_diagnostics["eastus2"].azurerm_monitor_diagnostic_setting.diag will be created
  + resource "azurerm_monitor_diagnostic_setting" "diag" {
      + eventhub_authorization_rule_id = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-azmon-eastus2-rg/providers/Microsoft.EventHub/namespaces/dbdemo-nprd-azmon-eastus2-ehn/authorizationRules/RootManageSharedAccessKey"
      + eventhub_name                  = "dbdemo-nprd-azmon-eastus2-ehn"
      + id                             = (known after apply)
      + log_analytics_destination_type = "Dedicated"
      + log_analytics_workspace_id     = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-azmon-eastus2-rg/providers/Microsoft.OperationalInsights/workspaces/dbdemo-nprd-azmon-eastus2-log"
      + name                           = "dbdemo-nprd-hub-eastus2-fw-diag"
      + storage_account_id             = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-azmon-eastus2-rg/providers/Microsoft.Storage/storageAccounts/dbdemonprdazmoneastus2st"
      + target_resource_id             = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus2-fw"

      + enabled_log {
          + category = "VMProtectionAlerts"
        }

      + metric {
          + category = "AllMetrics"
          + enabled  = true
        }
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["AzureBastionSubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.4.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureBastionSubnet"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus2-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["AzureFirewallSubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.2.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "AzureFirewallSubnet"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus2-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["GatewaySubnet"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.0.96/27",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "GatewaySubnet"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus2-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-ServiceNowVM"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.0.64/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-ServiceNowVM"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus2-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-ehsplunk"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.0.48/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-ehsplunk"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus2-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-integration"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.0.0/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-integration"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus2-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-integration2"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.0.16/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-integration2"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus2-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-integration3"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.0.32/28",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-integration3"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus2-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-pvtendpoint"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.8.0/21",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-pvtendpoint"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus2-fw"
    }

  # module.hub.module.hubnetworks.module.hub_virtual_networks["eastus2"].azurerm_subnet.subnet["dbdemo-nprd-hub-eastus-snet-vmss"] will be created
  + resource "azurerm_subnet" "subnet" {
      + address_prefixes                               = [
          + "172.20.6.0/23",
        ]
      + enforce_private_link_endpoint_network_policies = (known after apply)
      + enforce_private_link_service_network_policies  = (known after apply)
      + id                                             = (known after apply)
      + name                                           = "dbdemo-nprd-hub-eastus-snet-vmss"
      + private_endpoint_network_policies_enabled      = true
      + private_link_service_network_policies_enabled  = true
      + resource_group_name                            = "dbdemo-nprd-hub-eastus2-rg"
      + virtual_network_name                           = "dbdemo-nprd-hub-eastus2-fw"
    }

Plan: 34 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + hub_networks                = {
      + eastus  = {
          + address_spaces        = [
              + "172.20.0.0/20",
            ]
          + hub_router_ip_address = "1.2.3.4"
          + id                    = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw"
          + location              = "eastus"
          + name                  = "dbdemo-nprd-hub-eastus-fw"
          + resource_group_name   = "dbdemo-nprd-hub-eastus-rg"
          + subnets_name_id       = {
              + AzureBastionSubnet                       = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/AzureBastionSubnet"
              + AzureFirewallSubnet                      = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/AzureFirewallSubnet"
              + GatewaySubnet                            = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/GatewaySubnet"
              + dbdemo-nprd-hub-eastus-snet-ServiceNowVM = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/dbdemo-nprd-hub-eastus-snet-ServiceNowVM"
              + dbdemo-nprd-hub-eastus-snet-ehsplunk     = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/dbdemo-nprd-hub-eastus-snet-ehsplunk"
              + dbdemo-nprd-hub-eastus-snet-integration  = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/dbdemo-nprd-hub-eastus-snet-integration"
              + dbdemo-nprd-hub-eastus-snet-integration2 = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/dbdemo-nprd-hub-eastus-snet-integration2"
              + dbdemo-nprd-hub-eastus-snet-integration3 = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/dbdemo-nprd-hub-eastus-snet-integration3"
              + dbdemo-nprd-hub-eastus-snet-pvtendpoint  = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/dbdemo-nprd-hub-eastus-snet-pvtendpoint"
              + dbdemo-nprd-hub-eastus-snet-vmss         = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus-fw/subnets/dbdemo-nprd-hub-eastus-snet-vmss"
            }
        }
      + eastus2 = {
          + address_spaces        = [
              + "172.21.0.0/20",
            ]
          + hub_router_ip_address = "1.2.3.4"
          + id                    = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-hub-eastus2-rg/providers/Microsoft.Network/virtualNetworks/dbdemo-nprd-hub-eastus2-fw"
          + location              = "eastus2"
          + name                  = "dbdemo-nprd-hub-eastus2-fw"
          + resource_group_name   = "dbdemo-nprd-hub-eastus2-rg"
          + subnets_name_id       = {
              + AzureBastionSubnet                       = (known after apply)
              + AzureFirewallSubnet                      = (known after apply)
              + GatewaySubnet                            = (known after apply)
              + dbdemo-nprd-hub-eastus-snet-ServiceNowVM = (known after apply)
              + dbdemo-nprd-hub-eastus-snet-ehsplunk     = (known after apply)
              + dbdemo-nprd-hub-eastus-snet-integration  = (known after apply)
              + dbdemo-nprd-hub-eastus-snet-integration2 = (known after apply)
              + dbdemo-nprd-hub-eastus-snet-integration3 = (known after apply)
              + dbdemo-nprd-hub-eastus-snet-pvtendpoint  = (known after apply)
              + dbdemo-nprd-hub-eastus-snet-vmss         = (known after apply)
            }
        }
    }
  + hub_private_dns_zones       = {
      + "privatelink.blob.core.windows.net" = {
          + id                                                    = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-private-dns-eastus-rg/providers/Microsoft.Network/privateDnsZones/privatelink.blob.core.windows.net"
          + max_number_of_record_sets                             = 25000
          + max_number_of_virtual_network_links                   = 1000
          + max_number_of_virtual_network_links_with_registration = 100
          + name                                                  = "privatelink.blob.core.windows.net"
          + number_of_record_sets                                 = 1
          + resource_group_name                                   = "dbdemo-nprd-private-dns-eastus-rg"
          + soa_record                                            = [
              + {
                  + email         = "azureprivatedns-host.microsoft.com"
                  + expire_time   = 2419200
                  + fqdn          = "privatelink.blob.core.windows.net."
                  + host_name     = "azureprivatedns.net"
                  + minimum_ttl   = 10
                  + refresh_time  = 3600
                  + retry_time    = 300
                  + serial_number = 1
                  + tags          = {}
                  + ttl           = 3600
                },
            ]
          + tags                                                  = {
              + environment = "nprd"
              + owner       = "av"
              + source      = "terraform"
              + stack       = "hub"
            }
          + timeouts                                              = null
        }
    }
  ~ hub_public_ip_prefixes      = {
      ~ eastus  = {
            id                  = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-pips-eastus-rg/providers/Microsoft.Network/publicIPPrefixes/dbdemo-nprd-pips-eastus-pippf"
            name                = "dbdemo-nprd-pips-eastus-pippf"
            tags                = {
                environment = "nprd"
                owner       = "av"
                role        = "hub_bastion_public_ip_prefix"
                source      = "terraform"
                stack       = "hub"
            }
          ~ zones               = null -> []
            # (7 unchanged attributes hidden)
        }
      ~ eastus2 = {
            id                  = "/subscriptions/94f17a7c-1cbb-4e9b-a227-f894fa63a07b/resourceGroups/dbdemo-nprd-pips-eastus2-rg/providers/Microsoft.Network/publicIPPrefixes/dbdemo-nprd-pips-eastus2-pippf"
            name                = "dbdemo-nprd-pips-eastus2-pippf"
            tags                = {
                environment = "nprd"
                owner       = "av"
                role        = "hub_bastion_public_ip_prefix"
                source      = "terraform"
                stack       = "hub"
            }
          ~ zones               = null -> []
            # (7 unchanged attributes hidden)
        }
    }
```
</details>